docs/publishing.org
#+TITLE: Org Publishing System
#+AUTHOR: Scimax VS Code
#+DATE: 2026-01-16
#+STARTUP: overview
#+OPTIONS: toc:t num:t
#+TODO: ⚠️ 👀 | ✅

* Overview

The Scimax VS Code extension provides an org-publishing system for converting multiple org-mode documents into a cohesive HTML website. This is ideal for creating documentation sites, blogs, or project pages hosted on GitHub Pages.

The publishing system follows a wizard-first approach - most users can get started with a few clicks, while power users can customize everything through a JSON configuration file.

* Quick Start

** Step 1: Initialize a Publishing Project

Run the command =Scimax: Initialize Publishing Project= (=C-c C-p i=) to start the 5-step wizard:

1. *Project name* - A short identifier (e.g., "my-website")
2. *Source directory* - Where your org files are located (default: =./org=)
3. *Output directory* - Where HTML files will be published (default: =./docs= for GitHub Pages)
4. *Publishing target* - GitHub Pages (recommended) or Local/Custom
5. *Sitemap generation* - Whether to auto-generate an index page

** Step 2: Add Content

Create or edit =.org= files in your source directory. Each file becomes an HTML page.

Example =./org/about.org=:
#+BEGIN_SRC org
,#+TITLE: About This Project
,#+AUTHOR: Your Name
,#+DATE: 2026-01-16

,* Introduction

Welcome to my project documentation!

,* Features

- Feature one
- Feature two
#+END_SRC

** Step 3: Publish

Run =Scimax: Publish Project= (=C-c C-p p=) to generate HTML files.

** Step 4: Deploy to GitHub Pages

1. Commit the =./docs= folder to your repository
2. Go to your repository's Settings → Pages
3. Set Source to "Deploy from a branch"
4. Select =main= branch and =/docs= folder
5. Your site will be live at =https://username.github.io/repo-name/=

* Commands

| Command                              | Keybinding      | Description                       |
|--------------------------------------+-----------------+-----------------------------------|
| =scimax.publish.init=                | =C-c C-p i=     | Initialize publishing project     |
| =scimax.publish.project=             | =C-c C-p p=     | Publish selected project          |
| =scimax.publish.file=                | =C-c C-p f=     | Publish current file only         |
| =scimax.publish.all=                 | =C-c C-p a=     | Publish all configured projects   |
| =scimax.publish.preview=             | =C-c C-p v=     | Preview published site in browser |
| =scimax.publish.openConfig=          | -               | Open .org-publish.json config     |

* Configuration File

The wizard creates a =.org-publish.json= file in your project root. You can also create or edit this file manually.

** Basic Configuration

#+BEGIN_SRC json
{
  "projects": {
    "website": {
      "baseDirectory": "./org",
      "publishingDirectory": "./docs",
      "recursive": true,
      "autoSitemap": true
    }
  },
  "githubPages": true
}
#+END_SRC

** Full Configuration Reference

#+BEGIN_SRC json
{
  "projects": {
    "my-website": {
      "baseDirectory": "./org",
      "baseExtension": "org",
      "publishingDirectory": "./docs",
      "recursive": true,

      "exclude": "drafts/*",
      "include": ["extra/special.org"],

      "publishingFunction": "org-html-publish-to-html",

      "autoSitemap": true,
      "sitemapFilename": "index.org",
      "sitemapTitle": "Home",
      "sitemapStyle": "list",
      "sitemapSortFiles": "alphabetically",
      "sitemapSortFolders": "first",

      "htmlPreamble": "./templates/nav.html",
      "htmlPostamble": "./templates/footer.html",
      "htmlHead": "<meta name=\"keywords\" content=\"org-mode, documentation\">",
      "htmlHeadExtra": "<link rel=\"icon\" href=\"/favicon.ico\">",
      "cssFiles": ["./css/style.css"],
      "jsFiles": ["./js/custom.js"],
      "useDefaultTheme": true,

      "withAuthor": true,
      "withCreator": true,
      "withToc": true,
      "sectionNumbers": false,
      "defaultTitle": "Untitled"
    }
  },
  "githubPages": true,
  "customDomain": "docs.example.com",
  "defaultProject": "my-website"
}
#+END_SRC

* Configuration Options

** File Selection Options

| Option                 | Type     | Default | Description                                    |
|------------------------+----------+---------+------------------------------------------------|
| =baseDirectory=        | string   | -       | Source directory containing org files          |
| =baseExtension=        | string   | ="org"= | File extension to match (without dot)          |
| =publishingDirectory=  | string   | -       | Output directory for HTML files                |
| =recursive=            | boolean  | =true=  | Process subdirectories                         |
| =exclude=              | string   | -       | Glob pattern to exclude files (e.g., "drafts/*") |
| =include=              | string[] | =[]     | Extra files to include                         |

** Publishing Function Options

| Option               | Type   | Default                       | Description                    |
|----------------------+--------+-------------------------------+--------------------------------|
| =publishingFunction= | string | ="org-html-publish-to-html"=  | How to process files           |

Available functions:
- =org-html-publish-to-html= - Convert org files to HTML
- =copy= - Copy files as-is (for static assets)

