docs-html/publishing.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Org Publishing System</title>
<meta name="author" content="Scimax VS Code" />
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/highlight.js/11.9.0/styles/default.min.css" />
</head>
<body>
<main class="org-content">
<header id="title-block">
<h1 class="title">Org Publishing System</h1>
<p class="author">Scimax VS Code</p>
<p class="date">2026-01-16</p>
</header>
<div id="org-overview" class="org-section org-level-1">
<h1>Overview</h1>
<p>The Scimax VS Code extension provides an org-publishing system for converting multiple org-mode documents into a cohesive HTML website. This is ideal for creating documentation sites, blogs, or project pages hosted on GitHub Pages.</p>

<p>The publishing system follows a wizard-first approach - most users can get started with a few clicks, while power users can customize everything through a JSON configuration file.</p>

</div>
<div id="org-quick-start" class="org-section org-level-1">
<h1>Quick Start</h1>
<div id="org-step-1-initialize-a-publishing-project" class="org-section org-level-2">
<h2>Step 1: Initialize a Publishing Project</h2>
<p>Run the command <code class="verbatim">Scimax: Initialize Publishing Project</code> (<code class="verbatim">C-c C-p i</code>) to start the 5-step wizard:</p>

<ol>
<li><p><strong>Project name</strong> - A short identifier (e.g., &quot;my-website&quot;)</p>
</li>
<li><p><strong>Source directory</strong> - Where your org files are located (default: <code class="verbatim">./org</code>)</p>
</li>
<li><p><strong>Output directory</strong> - Where HTML files will be published (default: <code class="verbatim">./docs</code> for GitHub Pages)</p>
</li>
<li><p><strong>Publishing target</strong> - GitHub Pages (recommended) or Local/Custom</p>
</li>
<li><p><strong>Sitemap generation</strong> - Whether to auto-generate an index page</p>
</li>
</ol>

</div>
<div id="org-step-2-add-content" class="org-section org-level-2">
<h2>Step 2: Add Content</h2>
<p>Create or edit <code class="verbatim">.org</code> files in your source directory. Each file becomes an HTML page.</p>

<p>Example <code class="verbatim">./org/about.org</code>:</p>

<div class="org-src-container">
<pre class="src src-org"><code class="language-org">,#+TITLE: About This Project
,#+AUTHOR: Your Name
,#+DATE: 2026-01-16

,* Introduction

Welcome to my project documentation!

,* Features

- Feature one
- Feature two</code></pre>
</div>

</div>
<div id="org-step-3-publish" class="org-section org-level-2">
<h2>Step 3: Publish</h2>
<p>Run <code class="verbatim">Scimax: Publish Project</code> (<code class="verbatim">C-c C-p p</code>) to generate HTML files.</p>

</div>
<div id="org-step-4-deploy-to-github-pages" class="org-section org-level-2">
<h2>Step 4: Deploy to GitHub Pages</h2>
<ol>
<li><p>Commit the <code class="verbatim">./docs</code> folder to your repository</p>
</li>
<li><p>Go to your repository&#39;s Settings → Pages</p>
</li>
<li><p>Set Source to &quot;Deploy from a branch&quot;</p>
</li>
<li><p>Select <code class="verbatim">main</code> branch and <code class="verbatim">/docs</code> folder</p>
</li>
<li><p>Your site will be live at <code class="verbatim">https://username.github.io/repo-name/</code></p>
</li>
</ol>

</div>
</div>
<div id="org-commands" class="org-section org-level-1">
<h1>Commands</h1>
<table class="org-table">
<thead>
<tr><th>Command</th><th>Keybinding</th><th>Description</th></tr>
</thead>
<tbody>
<tr><td><code class="verbatim">scimax.publish.init</code></td><td><code class="verbatim">C-c C-p i</code></td><td>Initialize publishing project</td></tr>
<tr><td><code class="verbatim">scimax.publish.project</code></td><td><code class="verbatim">C-c C-p p</code></td><td>Publish selected project</td></tr>
<tr><td><code class="verbatim">scimax.publish.file</code></td><td><code class="verbatim">C-c C-p f</code></td><td>Publish current file only</td></tr>
<tr><td><code class="verbatim">scimax.publish.all</code></td><td><code class="verbatim">C-c C-p a</code></td><td>Publish all configured projects</td></tr>
<tr><td><code class="verbatim">scimax.publish.preview</code></td><td><code class="verbatim">C-c C-p v</code></td><td>Preview published site in browser</td></tr>
<tr><td><code class="verbatim">scimax.publish.openConfig</code></td><td>-</td><td>Open .org-publish.json config</td></tr>
</tbody>
</table>

</div>
<div id="org-configuration-file" class="org-section org-level-1">
<h1>Configuration File</h1>
<p>The wizard creates a <code class="verbatim">.org-publish.json</code> file in your project root. You can also create or edit this file manually.</p>

<div id="org-basic-configuration" class="org-section org-level-2">
<h2>Basic Configuration</h2>
<div class="org-src-container">
<pre class="src src-json"><code class="language-json">{
  &quot;projects&quot;: {
    &quot;website&quot;: {
      &quot;baseDirectory&quot;: &quot;./org&quot;,
      &quot;publishingDirectory&quot;: &quot;./docs&quot;,
      &quot;recursive&quot;: true,
      &quot;autoSitemap&quot;: true
    }
  },
  &quot;githubPages&quot;: true
}</code></pre>
</div>

</div>
<div id="org-full-configuration-reference" class="org-section org-level-2">
<h2>Full Configuration Reference</h2>
<div class="org-src-container">
<pre class="src src-json"><code class="language-json">{
  &quot;projects&quot;: {
    &quot;my-website&quot;: {
      &quot;baseDirectory&quot;: &quot;./org&quot;,
      &quot;baseExtension&quot;: &quot;org&quot;,
      &quot;publishingDirectory&quot;: &quot;./docs&quot;,
      &quot;recursive&quot;: true,

      &quot;exclude&quot;: &quot;drafts/*&quot;,
      &quot;include&quot;: [&quot;extra/special.org&quot;],

      &quot;publishingFunction&quot;: &quot;org-html-publish-to-html&quot;,

      &quot;autoSitemap&quot;: true,
      &quot;sitemapFilename&quot;: &quot;index.org&quot;,
      &quot;sitemapTitle&quot;: &quot;Home&quot;,
      &quot;sitemapStyle&quot;: &quot;list&quot;,
      &quot;sitemapSortFiles&quot;: &quot;alphabetically&quot;,
      &quot;sitemapSortFolders&quot;: &quot;first&quot;,

      &quot;htmlPreamble&quot;: &quot;./templates/nav.html&quot;,
      &quot;htmlPostamble&quot;: &quot;./templates/footer.html&quot;,
      &quot;htmlHead&quot;: &quot;&lt;meta name=\&quot;keywords\&quot; content=\&quot;org-mode, documentation\&quot;&gt;&quot;,
      &quot;htmlHeadExtra&quot;: &quot;&lt;link rel=\&quot;icon\&quot; href=\&quot;/favicon.ico\&quot;&gt;&quot;,
      &quot;cssFiles&quot;: [&quot;./css/style.css&quot;],
      &quot;jsFiles&quot;: [&quot;./js/custom.js&quot;],
      &quot;useDefaultTheme&quot;: true,

      &quot;withAuthor&quot;: true,
      &quot;withCreator&quot;: true,
      &quot;withToc&quot;: true,
      &quot;sectionNumbers&quot;: false,
      &quot;defaultTitle&quot;: &quot;Untitled&quot;
    }
  },
  &quot;githubPages&quot;: true,
  &quot;customDomain&quot;: &quot;docs.example.com&quot;,
  &quot;defaultProject&quot;: &quot;my-website&quot;
}</code></pre>
</div>

</div>
</div>
<div id="org-configuration-options" class="org-section org-level-1">
<h1>Configuration Options</h1>
<div id="org-file-selection-options" class="org-section org-level-2">
<h2>File Selection Options</h2>
<table class="org-table">
<thead>
<tr><th>Option</th><th>Type</th><th>Default</th><th>Description</th></tr>
</thead>
<tbody>
<tr><td><code class="verbatim">baseDirectory</code></td><td>string</td><td>-</td><td>Source directory containing org files</td></tr>
<tr><td><code class="verbatim">baseExtension</code></td><td>string</td><td><code class="verbatim">&quot;org&quot;</code></td><td>File extension to match (without dot)</td></tr>
<tr><td><code class="verbatim">publishingDirectory</code></td><td>string</td><td>-</td><td>Output directory for HTML files</td></tr>
<tr><td><code class="verbatim">recursive</code></td><td>boolean</td><td><code class="verbatim">true</code></td><td>Process subdirectories</td></tr>
<tr><td><code class="verbatim">exclude</code></td><td>string</td><td>-</td><td>Glob pattern to exclude files (e.g., &quot;drafts/*&quot;)</td></tr>
<tr><td><code class="verbatim">include</code></td><td>string[]</td><td>=[]</td><td>Extra files to include</td></tr>
</tbody>
</table>

</div>
<div id="org-publishing-function-options" class="org-section org-level-2">
<h2>Publishing Function Options</h2>
<table class="org-table">
<thead>
<tr><th>Option</th><th>Type</th><th>Default</th><th>Description</th></tr>
</thead>
<tbody>
<tr><td><code class="verbatim">publishingFunction</code></td><td>string</td><td><code class="verbatim">&quot;org-html-publish-to-html&quot;</code></td><td>How to process files</td></tr>
</tbody>
</table>

<p>Available functions:</p>

<ul>
<li><p><code class="verbatim">org-html-publish-to-html</code> - Convert org files to HTML</p>
</li>
<li><p><code class="verbatim">copy</code> - Copy files as-is (for static assets)</p>
</li>
</ul>

</div>
