docs/publishing.org
** Sitemap Options

| Option              | Type             | Default           | Description                          |
|---------------------+------------------+-------------------+--------------------------------------|
| =autoSitemap=       | boolean          | =true=            | Generate sitemap automatically       |
| =sitemapFilename=   | string           | ="sitemap.org"=   | Sitemap file name                    |
| =sitemapTitle=      | string           | ="Site Map"=      | Title for sitemap page               |
| =sitemapStyle=      | ="list"= / ="tree"= | ="list"=       | Sitemap display format               |
| =sitemapSortFiles=  | string           | ="alphabetically"= | Sort order for files                |
| =sitemapSortFolders= | string          | ="first"=         | Where to place folders in listing    |

Sort options for =sitemapSortFiles=:
- =alphabetically= - Sort A-Z by title
- =chronologically= - Oldest first (by #+DATE)
- =anti-chronologically= - Newest first (for blogs)

** HTML Template Options

| Option          | Type     | Description                                      |
|-----------------+----------+--------------------------------------------------|
| =htmlPreamble=  | string   | File path or HTML string for header/navigation   |
| =htmlPostamble= | string   | File path or HTML string for footer              |
| =htmlHead=      | string   | Extra content for =<head>= section               |
| =htmlHeadExtra= | string   | Additional head content (appended)               |
| =cssFiles=      | string[] | CSS files to include                             |
| =jsFiles=       | string[] | JavaScript files to include                      |
| =useDefaultTheme= | boolean | Include built-in CSS theme (default: true)      |

** Export Options

| Option           | Type             | Default | Description                    |
|------------------+------------------+---------+--------------------------------|
| =withAuthor=     | boolean          | =true=  | Include author in output       |
| =withCreator=    | boolean          | =true=  | Include generator info         |
| =withToc=        | boolean / number | =true=  | Table of contents (or depth)   |
| =sectionNumbers= | boolean          | =false= | Number sections                |
| =defaultTitle=   | string           | -       | Default title if not specified |

** Global Options

| Option          | Type    | Description                              |
|-----------------+---------+------------------------------------------|
| =githubPages=   | boolean | Enable GitHub Pages features             |
| =customDomain=  | string  | Custom domain (creates CNAME file)       |
| =defaultProject= | string | Project to publish when none specified   |

* Multi-Project Configuration

You can define multiple projects for different parts of your site:

#+BEGIN_SRC json
{
  "projects": {
    "pages": {
      "baseDirectory": "./org",
      "publishingDirectory": "./docs",
      "recursive": true,
      "autoSitemap": true
    },
    "static": {
      "baseDirectory": "./assets",
      "publishingDirectory": "./docs/assets",
      "baseExtension": "css|js|png|jpg|svg",
      "publishingFunction": "copy"
    },
    "full-site": {
      "components": ["pages", "static"]
    }
  }
}
#+END_SRC

** Component Projects

A component project groups multiple projects together:

#+BEGIN_SRC json
{
  "full-site": {
    "components": ["pages", "static", "images"]
  }
}
#+END_SRC

When you publish "full-site", all component projects are published in order.

* Templates

** HTML Preamble (Navigation)

Create a file like =./templates/nav.html=:

#+BEGIN_SRC html
<nav class="site-nav">
    <a href="index.html">Home</a>
    <a href="about.html">About</a>
    <a href="sitemap.html">Contents</a>
</nav>
#+END_SRC

Reference it in your config:

#+BEGIN_SRC json
{
  "htmlPreamble": "./templates/nav.html"
}
#+END_SRC

** HTML Postamble (Footer)

Create =./templates/footer.html=:

#+BEGIN_SRC html
<footer>
    <p>&copy; 2026 Your Name. Generated by scimax-vscode.</p>
</footer>
#+END_SRC

** Custom CSS

Create =./css/style.css= and reference it:

#+BEGIN_SRC json
{
  "cssFiles": ["./css/style.css"]
}
#+END_SRC

* GitHub Pages Integration

When =githubPages= is enabled:

1. A =.nojekyll= file is created in the output directory (disables Jekyll processing)
2. If =customDomain= is set, a =CNAME= file is created
3. The default output directory is =./docs= (GitHub Pages convention)
4. The default sitemap becomes =index.org= → =index.html=

** Custom Domain Setup

To use a custom domain:

#+BEGIN_SRC json
{
  "githubPages": true,
  "customDomain": "docs.example.com"
}
#+END_SRC

Then configure your DNS to point to GitHub Pages.

* Cross-File Links

Links between org files are automatically converted to HTML links:

#+BEGIN_SRC org
See [[file:other-page.org][the other page]] for details.
#+END_SRC

Becomes:

#+BEGIN_SRC html
See <a href="other-page.html">the other page</a> for details.
#+END_SRC

* Workflow Examples

** Documentation Site

#+BEGIN_SRC json
{
  "projects": {
    "docs": {
      "baseDirectory": "./docs-src",
      "publishingDirectory": "./docs",
      "autoSitemap": true,
      "sitemapFilename": "index.org",
      "sitemapTitle": "Documentation",
      "withToc": 2
    }
  },
  "githubPages": true
}
#+END_SRC

