docs-html/publishing.html
<div id="org-sitemap-options" class="org-section org-level-2">
<h2>Sitemap Options</h2>
<table class="org-table">
<thead>
<tr><th>Option</th><th>Type</th><th>Default</th><th>Description</th></tr>
</thead>
<tbody>
<tr><td><code class="verbatim">autoSitemap</code></td><td>boolean</td><td><code class="verbatim">true</code></td><td>Generate sitemap automatically</td></tr>
<tr><td><code class="verbatim">sitemapFilename</code></td><td>string</td><td><code class="verbatim">&quot;sitemap.org&quot;</code></td><td>Sitemap file name</td></tr>
<tr><td><code class="verbatim">sitemapTitle</code></td><td>string</td><td><code class="verbatim">&quot;Site Map&quot;</code></td><td>Title for sitemap page</td></tr>
<tr><td><code class="verbatim">sitemapStyle</code></td><td><code class="verbatim">&quot;list&quot;</code> / <code class="verbatim">&quot;tree&quot;</code></td><td><code class="verbatim">&quot;list&quot;</code></td><td>Sitemap display format</td></tr>
<tr><td><code class="verbatim">sitemapSortFiles</code></td><td>string</td><td><code class="verbatim">&quot;alphabetically&quot;</code></td><td>Sort order for files</td></tr>
<tr><td><code class="verbatim">sitemapSortFolders</code></td><td>string</td><td><code class="verbatim">&quot;first&quot;</code></td><td>Where to place folders in listing</td></tr>
</tbody>
</table>

<p>Sort options for <code class="verbatim">sitemapSortFiles</code>:</p>

<ul>
<li><p><code class="verbatim">alphabetically</code> - Sort A-Z by title</p>
</li>
<li><p><code class="verbatim">chronologically</code> - Oldest first (by #+DATE)</p>
</li>
<li><p><code class="verbatim">anti-chronologically</code> - Newest first (for blogs)</p>
</li>
</ul>

</div>
<div id="org-html-template-options" class="org-section org-level-2">
<h2>HTML Template Options</h2>
<table class="org-table">
<thead>
<tr><th>Option</th><th>Type</th><th>Description</th></tr>
</thead>
<tbody>
<tr><td><code class="verbatim">htmlPreamble</code></td><td>string</td><td>File path or HTML string for header/navigation</td></tr>
<tr><td><code class="verbatim">htmlPostamble</code></td><td>string</td><td>File path or HTML string for footer</td></tr>
<tr><td><code class="verbatim">htmlHead</code></td><td>string</td><td>Extra content for <code class="verbatim">&lt;head&gt;</code> section</td></tr>
<tr><td><code class="verbatim">htmlHeadExtra</code></td><td>string</td><td>Additional head content (appended)</td></tr>
<tr><td><code class="verbatim">cssFiles</code></td><td>string[]</td><td>CSS files to include</td></tr>
<tr><td><code class="verbatim">jsFiles</code></td><td>string[]</td><td>JavaScript files to include</td></tr>
<tr><td><code class="verbatim">useDefaultTheme</code></td><td>boolean</td><td>Include built-in CSS theme (default: true)</td></tr>
</tbody>
</table>

</div>
<div id="org-export-options" class="org-section org-level-2">
<h2>Export Options</h2>
<table class="org-table">
<thead>
<tr><th>Option</th><th>Type</th><th>Default</th><th>Description</th></tr>
</thead>
<tbody>
<tr><td><code class="verbatim">withAuthor</code></td><td>boolean</td><td><code class="verbatim">true</code></td><td>Include author in output</td></tr>
<tr><td><code class="verbatim">withCreator</code></td><td>boolean</td><td><code class="verbatim">true</code></td><td>Include generator info</td></tr>
<tr><td><code class="verbatim">withToc</code></td><td>boolean / number</td><td><code class="verbatim">true</code></td><td>Table of contents (or depth)</td></tr>
<tr><td><code class="verbatim">sectionNumbers</code></td><td>boolean</td><td><code class="verbatim">false</code></td><td>Number sections</td></tr>
<tr><td><code class="verbatim">defaultTitle</code></td><td>string</td><td>-</td><td>Default title if not specified</td></tr>
</tbody>
</table>

</div>
<div id="org-global-options" class="org-section org-level-2">
<h2>Global Options</h2>
<table class="org-table">
<thead>
<tr><th>Option</th><th>Type</th><th>Description</th></tr>
</thead>
<tbody>
<tr><td><code class="verbatim">githubPages</code></td><td>boolean</td><td>Enable GitHub Pages features</td></tr>
<tr><td><code class="verbatim">customDomain</code></td><td>string</td><td>Custom domain (creates CNAME file)</td></tr>
<tr><td><code class="verbatim">defaultProject</code></td><td>string</td><td>Project to publish when none specified</td></tr>
</tbody>
</table>

</div>
</div>
<div id="org-multi-project-configuration" class="org-section org-level-1">
<h1>Multi-Project Configuration</h1>
<p>You can define multiple projects for different parts of your site:</p>

<div class="org-src-container">
<pre class="src src-json"><code class="language-json">{
  &quot;projects&quot;: {
    &quot;pages&quot;: {
      &quot;baseDirectory&quot;: &quot;./org&quot;,
      &quot;publishingDirectory&quot;: &quot;./docs&quot;,
      &quot;recursive&quot;: true,
      &quot;autoSitemap&quot;: true
    },
    &quot;static&quot;: {
      &quot;baseDirectory&quot;: &quot;./assets&quot;,
      &quot;publishingDirectory&quot;: &quot;./docs/assets&quot;,
      &quot;baseExtension&quot;: &quot;css|js|png|jpg|svg&quot;,
      &quot;publishingFunction&quot;: &quot;copy&quot;
    },
    &quot;full-site&quot;: {
      &quot;components&quot;: [&quot;pages&quot;, &quot;static&quot;]
    }
  }
}</code></pre>
</div>

<div id="org-component-projects" class="org-section org-level-2">
<h2>Component Projects</h2>
<p>A component project groups multiple projects together:</p>

<div class="org-src-container">
<pre class="src src-json"><code class="language-json">{
  &quot;full-site&quot;: {
    &quot;components&quot;: [&quot;pages&quot;, &quot;static&quot;, &quot;images&quot;]
  }
}</code></pre>
</div>

<p>When you publish &quot;full-site&quot;, all component projects are published in order.</p>

</div>
</div>
<div id="org-templates" class="org-section org-level-1">
<h1>Templates</h1>
<div id="org-html-preamble-navigation" class="org-section org-level-2">
<h2>HTML Preamble (Navigation)</h2>
<p>Create a file like <code class="verbatim">./templates/nav.html</code>:</p>

<div class="org-src-container">
<pre class="src src-html"><code class="language-html">&lt;nav class=&quot;site-nav&quot;&gt;
    &lt;a href=&quot;index.html&quot;&gt;Home&lt;/a&gt;
    &lt;a href=&quot;about.html&quot;&gt;About&lt;/a&gt;
    &lt;a href=&quot;sitemap.html&quot;&gt;Contents&lt;/a&gt;
&lt;/nav&gt;</code></pre>
</div>

<p>Reference it in your config:</p>

<div class="org-src-container">
<pre class="src src-json"><code class="language-json">{
  &quot;htmlPreamble&quot;: &quot;./templates/nav.html&quot;
}</code></pre>
</div>

</div>
<div id="org-html-postamble-footer" class="org-section org-level-2">
<h2>HTML Postamble (Footer)</h2>
<p>Create <code class="verbatim">./templates/footer.html</code>:</p>

<div class="org-src-container">
<pre class="src src-html"><code class="language-html">&lt;footer&gt;
    &lt;p&gt;&amp;copy; 2026 Your Name. Generated by scimax-vscode.&lt;/p&gt;
&lt;/footer&gt;</code></pre>
</div>

</div>
<div id="org-custom-css" class="org-section org-level-2">
<h2>Custom CSS</h2>
<p>Create <code class="verbatim">./css/style.css</code> and reference it:</p>

<div class="org-src-container">
<pre class="src src-json"><code class="language-json">{
  &quot;cssFiles&quot;: [&quot;./css/style.css&quot;]
}</code></pre>
</div>

</div>
</div>
<div id="org-github-pages-integration" class="org-section org-level-1">
<h1>GitHub Pages Integration</h1>
<p>When <code class="verbatim">githubPages</code> is enabled:</p>

<ol>
<li><p>A <code class="verbatim">.nojekyll</code> file is created in the output directory (disables Jekyll processing)</p>
</li>
<li><p>If <code class="verbatim">customDomain</code> is set, a <code class="verbatim">CNAME</code> file is created</p>
</li>
<li><p>The default output directory is <code class="verbatim">./docs</code> (GitHub Pages convention)</p>
</li>
<li><p>The default sitemap becomes <code class="verbatim">index.org</code> → <code class="verbatim">index.html</code></p>
</li>
</ol>

<div id="org-custom-domain-setup" class="org-section org-level-2">
<h2>Custom Domain Setup</h2>
<p>To use a custom domain:</p>

<div class="org-src-container">
<pre class="src src-json"><code class="language-json">{
  &quot;githubPages&quot;: true,
  &quot;customDomain&quot;: &quot;docs.example.com&quot;
}</code></pre>
</div>

<p>Then configure your DNS to point to GitHub Pages.</p>

</div>
</div>
<div id="org-cross-file-links" class="org-section org-level-1">
<h1>Cross-File Links</h1>
<p>Links between org files are automatically converted to HTML links:</p>

<div class="org-src-container">
<pre class="src src-org"><code class="language-org">See [[file:other-page.org][the other page]] for details.</code></pre>
</div>

<p>Becomes:</p>

<div class="org-src-container">
<pre class="src src-html"><code class="language-html">See &lt;a href=&quot;other-page.html&quot;&gt;the other page&lt;/a&gt; for details.</code></pre>
</div>

</div>
<div id="org-workflow-examples" class="org-section org-level-1">
<h1>Workflow Examples</h1>
<div id="org-documentation-site" class="org-section org-level-2">
<h2>Documentation Site</h2>
<div class="org-src-container">
<pre class="src src-json"><code class="language-json">{
  &quot;projects&quot;: {
    &quot;docs&quot;: {
      &quot;baseDirectory&quot;: &quot;./docs-src&quot;,
      &quot;publishingDirectory&quot;: &quot;./docs&quot;,
      &quot;autoSitemap&quot;: true,
      &quot;sitemapFilename&quot;: &quot;index.org&quot;,
      &quot;sitemapTitle&quot;: &quot;Documentation&quot;,
      &quot;withToc&quot;: 2
    }
  },
  &quot;githubPages&quot;: true
}</code></pre>
</div>

</div>
