docs/publishing.org
** Blog

#+BEGIN_SRC json
{
  "projects": {
    "blog": {
      "baseDirectory": "./posts",
      "publishingDirectory": "./docs",
      "autoSitemap": true,
      "sitemapFilename": "index.org",
      "sitemapTitle": "Blog",
      "sitemapSortFiles": "anti-chronologically",
      "htmlPreamble": "./templates/blog-header.html"
    }
  },
  "githubPages": true
}
#+END_SRC

** Project with Static Assets

#+BEGIN_SRC json
{
  "projects": {
    "pages": {
      "baseDirectory": "./org",
      "publishingDirectory": "./docs",
      "autoSitemap": true
    },
    "images": {
      "baseDirectory": "./images",
      "publishingDirectory": "./docs/images",
      "baseExtension": "png|jpg|gif|svg",
      "publishingFunction": "copy"
    },
    "css": {
      "baseDirectory": "./css",
      "publishingDirectory": "./docs/css",
      "baseExtension": "css",
      "publishingFunction": "copy"
    },
    "site": {
      "components": ["pages", "images", "css"]
    }
  },
  "githubPages": true,
  "defaultProject": "site"
}
#+END_SRC

* Troubleshooting

** "No publishing configuration found"

Run =Scimax: Initialize Publishing Project= (=C-c C-p i=) to create a =.org-publish.json= file.

** "Base directory does not exist"

Create the source directory specified in =baseDirectory=, or update the config to point to an existing directory.

** Links not working after publish

Ensure you're using =file:= links to reference other org files:
#+BEGIN_SRC org
[[file:other.org][Link text]]
#+END_SRC

** GitHub Pages not updating

1. Ensure the =./docs= folder is committed
2. Check that GitHub Pages is configured to serve from =/docs=
3. Wait a few minutes for GitHub to rebuild the site

* Related Topics

- [[file:export.org][Export System]] - Single-file export options
- [[file:source-blocks.org][Source Blocks]] - Code blocks in org files
- [[file:document-structure.org][Document Structure]] - Headings and organization
