docs-html/publishing.html
<div id="org-blog" class="org-section org-level-2">
<h2>Blog</h2>
<div class="org-src-container">
<pre class="src src-json"><code class="language-json">{
  &quot;projects&quot;: {
    &quot;blog&quot;: {
      &quot;baseDirectory&quot;: &quot;./posts&quot;,
      &quot;publishingDirectory&quot;: &quot;./docs&quot;,
      &quot;autoSitemap&quot;: true,
      &quot;sitemapFilename&quot;: &quot;index.org&quot;,
      &quot;sitemapTitle&quot;: &quot;Blog&quot;,
      &quot;sitemapSortFiles&quot;: &quot;anti-chronologically&quot;,
      &quot;htmlPreamble&quot;: &quot;./templates/blog-header.html&quot;
    }
  },
  &quot;githubPages&quot;: true
}</code></pre>
</div>

</div>
<div id="org-project-with-static-assets" class="org-section org-level-2">
<h2>Project with Static Assets</h2>
<div class="org-src-container">
<pre class="src src-json"><code class="language-json">{
  &quot;projects&quot;: {
    &quot;pages&quot;: {
      &quot;baseDirectory&quot;: &quot;./org&quot;,
      &quot;publishingDirectory&quot;: &quot;./docs&quot;,
      &quot;autoSitemap&quot;: true
    },
    &quot;images&quot;: {
      &quot;baseDirectory&quot;: &quot;./images&quot;,
      &quot;publishingDirectory&quot;: &quot;./docs/images&quot;,
      &quot;baseExtension&quot;: &quot;png|jpg|gif|svg&quot;,
      &quot;publishingFunction&quot;: &quot;copy&quot;
    },
    &quot;css&quot;: {
      &quot;baseDirectory&quot;: &quot;./css&quot;,
      &quot;publishingDirectory&quot;: &quot;./docs/css&quot;,
      &quot;baseExtension&quot;: &quot;css&quot;,
      &quot;publishingFunction&quot;: &quot;copy&quot;
    },
    &quot;site&quot;: {
      &quot;components&quot;: [&quot;pages&quot;, &quot;images&quot;, &quot;css&quot;]
    }
  },
  &quot;githubPages&quot;: true,
  &quot;defaultProject&quot;: &quot;site&quot;
}</code></pre>
</div>

</div>
</div>
<div id="org-troubleshooting" class="org-section org-level-1">
<h1>Troubleshooting</h1>
<div id="org-no-publishing-configuration-found" class="org-section org-level-2">
<h2>&quot;No publishing configuration found&quot;</h2>
<p>Run <code class="verbatim">Scimax: Initialize Publishing Project</code> (<code class="verbatim">C-c C-p i</code>) to create a <code class="verbatim">.org-publish.json</code> file.</p>

</div>
<div id="org-base-directory-does-not-exist" class="org-section org-level-2">
<h2>&quot;Base directory does not exist&quot;</h2>
<p>Create the source directory specified in <code class="verbatim">baseDirectory</code>, or update the config to point to an existing directory.</p>

</div>
<div id="org-links-not-working-after-publish" class="org-section org-level-2">
<h2>Links not working after publish</h2>
<p>Ensure you&#39;re using <code class="verbatim">file:</code> links to reference other org files:</p>

<div class="org-src-container">
<pre class="src src-org"><code class="language-org">[[file:other.org][Link text]]</code></pre>
</div>

</div>
<div id="org-github-pages-not-updating" class="org-section org-level-2">
<h2>GitHub Pages not updating</h2>
<ol>
<li><p>Ensure the <code class="verbatim">./docs</code> folder is committed</p>
</li>
<li><p>Check that GitHub Pages is configured to serve from <code class="verbatim">/docs</code></p>
</li>
<li><p>Wait a few minutes for GitHub to rebuild the site</p>
</li>
</ol>

</div>
</div>
<div id="org-related-topics" class="org-section org-level-1">
<h1>Related Topics</h1>
<ul>
<li><p><a href="export.html">Export System</a> - Single-file export options</p>
</li>
<li><p><a href="source-blocks.html">Source Blocks</a> - Code blocks in org files</p>
</li>
<li><p><a href="document-structure.html">Document Structure</a> - Headings and organization</p>
</li>
</ul>

</div>
</main>
</body>
</html>